work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>work</title>
<!-- 2017-03-30 Thu 13:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="pablo" />
</head>
<body>
<div id="content">
<h1 class="title">work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="done DONE">DONE</span> Request for Regional Planning Hours 2015-2016</a></li>
<li><a href="#sec-2">2. <span class="done DONE">DONE</span> send a request to George</a></li>
<li><a href="#sec-3">3. <span class="done DONE">DONE</span> Lake Desire Shorline Analysis Betsy</a></li>
<li><a href="#sec-4">4. <span class="todo TODO">TODO</span> Paratransit Routing</a>
<ul>
<li><a href="#sec-4-1">4.1. <span class="done DONE">DONE</span> Respond to follow-up questions so Dennis can respond to Tom</a></li>
</ul>
</li>
<li><a href="#sec-5">5. <span class="todo TODO">TODO</span> Respond to request for Mineral sites map.</a></li>
<li><a href="#sec-6">6. <span class="todo TODO">TODO</span> Roads updates for Travel Concurrency and MPS</a>
<ul>
<li><a href="#sec-6-1">6.1. <span class="todo TODO">TODO</span> Respond to Jim Ishimaru e-mail</a></li>
<li><a href="#sec-6-2">6.2. <span class="todo TODO">TODO</span> Create new map services for Accela GIS</a></li>
<li><a href="#sec-6-3">6.3. <span class="todo TODO">TODO</span> Test new map services for Accela GIS</a></li>
<li><a href="#sec-6-4">6.4. <span class="todo TODO">TODO</span> Update map services for Accela GIS Production</a></li>
<li><a href="#sec-6-5">6.5. Verify Adam has updated GISMO Parcel Information Report</a></li>
<li><a href="#sec-6-6">6.6. Verify District report is updated</a></li>
<li><a href="#sec-6-7">6.7. <span class="todo TODO">TODO</span> Remove MPS and TCMZONE from Plibrary</a></li>
</ul>
</li>
<li><a href="#sec-7">7. <span class="todo TODO">TODO</span> Take the lead on the Address point priority initiative</a>
<ul>
<li><a href="#sec-7-1">7.1. <span class="todo TODO">TODO</span> Review the text from the sharepoint site</a></li>
</ul>
</li>
<li><a href="#sec-8">8. <span class="todo TODO">TODO</span> Download ArcGIS Pro 1.4 &amp; Desktop 10.4.1</a>
<ul>
<li><a href="#sec-8-1">8.1. <span class="todo TODO">TODO</span> submit to desktop support people.</a>
<ul>
<li><a href="#sec-8-1-1">8.1.1. <span class="todo TODO">TODO</span> Cc george when this gets sent</a></li>
<li><a href="#sec-8-1-2">8.1.2. <span class="todo TODO">TODO</span> Ask Cory who else needs to know this information.</a></li>
</ul>
</li>
<li><a href="#sec-8-2">8.2. <span class="todo TODO">TODO</span> Tell Cory about the ArcGIS Pro 1.4 and put the installer somewhere</a></li>
<li><a href="#sec-8-3">8.3. <span class="todo TODO">TODO</span> Tell Mary to tell the other people when 10.4.1 is available</a></li>
</ul>
</li>
<li><a href="#sec-9">9. <span class="todo TODO">TODO</span> Figure out the PAA layer symbology for iMap</a></li>
<li><a href="#sec-10">10. <span class="todo TODO">TODO</span> Vashon Town core analysis/Plan - Brad Clark</a>
<ul>
<li><a href="#sec-10-1">10.1. <span class="todo TODO">TODO</span> Submit sidewalk map to designer</a></li>
</ul>
</li>
<li><a href="#sec-11">11. <span class="todo TODO">TODO</span> Follow-up on software for new laptops</a>
<ul>
<li><a href="#sec-11-1">11.1. <span class="todo TODO">TODO</span> Get back to Cory</a></li>
</ul>
</li>
<li><a href="#sec-12">12. <span class="todo TODO">TODO</span> Winery Map - Karen Wolf</a>
<ul>
<li><a href="#sec-12-1">12.1. <span class="todo TODO">TODO</span> Second Draft requested sent to DPER staff</a></li>
</ul>
</li>
<li><a href="#sec-13">13. <span class="todo TODO">TODO</span> Find missing maps for p-suffix conditions - Wendy G</a></li>
<li><a href="#sec-14">14. <span class="todo TODO">TODO</span> Caroline Boatsman - 206-595-8579</a></li>
<li><a href="#sec-15">15. <span class="todo TODO">TODO</span> Paul Freeman question about lot. 301-898-2631</a></li>
<li><a href="#sec-16">16. <span class="todo TODO">TODO</span> Lisa Verner - Large Parcel analysis</a></li>
<li><a href="#sec-17">17. <span class="todo TODO">TODO</span> Question about Mai's parcels</a></li>
<li><a href="#sec-18">18. <span class="todo TODO">TODO</span> Question from Stacey wenkel about not getting GIS in the inspection whatever</a></li>
<li><a href="#sec-19">19. <span class="todo TODO">TODO</span> Update parcel<sub>address</sub> Layer and key IDs for Accela Automation</a></li>
<li><a href="#sec-20">20. <span class="todo TODO">TODO</span> Implement the Comp Plan Changes</a>
<ul>
<li><a href="#sec-20-1">20.1. <span class="todo TODO">TODO</span> Update UGA</a></li>
<li><a href="#sec-20-2">20.2. <span class="todo TODO">TODO</span> Update PAA</a></li>
<li><a href="#sec-20-3">20.3. <span class="todo TODO">TODO</span> Update Complu</a></li>
<li><a href="#sec-20-4">20.4. <span class="todo TODO">TODO</span> Update Zoning</a></li>
<li><a href="#sec-20-5">20.5. <span class="todo TODO">TODO</span> Update Development Conditions</a></li>
</ul>
</li>
<li><a href="#sec-21">21. <span class="todo TODO">TODO</span> SMART GOAL: Regional Planning Section GIS Work Plan 2017-18</a>
<ul>
<li><a href="#sec-21-1">21.1. <span class="todo TODO">TODO</span> Prepare a document for the Regional Planning Section</a>
<ul>
<li><a href="#sec-21-1-1">21.1.1. <span class="todo TODO">TODO</span> Create a list of layers and get explicit feed-back on which are maintained by who</a></li>
</ul>
</li>
<li><a href="#sec-21-2">21.2. <span class="todo TODO">TODO</span> Get written acceptance of work plan from Lauren Smith or her designee.</a></li>
<li><a href="#sec-21-3">21.3. <span class="todo TODO">TODO</span> Schedule a time that Dennis and I can present to the Regional Planning Staff</a></li>
</ul>
</li>
<li><a href="#sec-22">22. <span class="todo TODO">TODO</span> SMART GOAL: Establish and create a document describing a new KCGIS governance process for spatial data warehouse layer maintenance prioritization and tracking, before July 2017, which will identify geographic information framework layers, track layer update frequencies, and allow the GIS Steering Committee to prioritize layers to receive update efforts as part of the KCGIS Center's operations program.</a></li>
<li><a href="#sec-23">23. <span class="todo TODO">TODO</span> SMART GOAL: Add 3 more counties to City<sub>3co</sub><sub>jurisdiction</sub> layer at the request of transit. IN 3/2/15</a>
<ul>
<li><a href="#sec-23-1">23.1. <span class="done DONE">DONE</span> Obtain feed-back from Gunnar</a></li>
<li><a href="#sec-23-2">23.2. <span class="todo TODO">TODO</span> Complete functional model</a></li>
<li><a href="#sec-23-3">23.3. <span class="todo TODO">TODO</span> Complete functional python script</a></li>
<li><a href="#sec-23-4">23.4. <span class="todo TODO">TODO</span> Post new layers</a></li>
<li><a href="#sec-23-5">23.5. <span class="todo TODO">TODO</span> Retire old layers</a></li>
</ul>
</li>
<li><a href="#sec-24">24. <span class="todo TODO">TODO</span> SMART GOAL: Tribal Lands</a>
<ul>
<li><a href="#sec-24-1">24.1. <span class="todo TODO">TODO</span> Create new layer in library control file</a></li>
</ul>
</li>
<li><a href="#sec-25">25. <span class="todo TODO">TODO</span> Change request for installing javascript accela gis</a>
<ul>
<li><a href="#sec-25-1">25.1. <span class="todo TODO">TODO</span> Send questions to Accela</a></li>
<li><a href="#sec-25-2">25.2. <span class="todo TODO">TODO</span> Figure out database</a></li>
</ul>
</li>
<li><a href="#sec-26">26. <span class="todo TODO">TODO</span> Look into Council zoning ordinance e-mail 11/9/16 report back to Christie</a></li>
<li><a href="#sec-27">27. <span class="todo TODO">TODO</span> Wictor lady e-mail 11/9/16</a></li>
<li><a href="#sec-28">28. <span class="todo TODO">TODO</span> SMART GOAL: Publish Steep Slope &amp; Landslide Hazard Layers for DPER</a>
<ul>
<li><a href="#sec-28-1">28.1. <span class="todo TODO">TODO</span> Greg Wessel - Fix the Steep Slopes Area to include missing portions</a></li>
<li><a href="#sec-28-2">28.2. <span class="todo TODO">TODO</span> Fix the Services Directory Description to include the proper links</a></li>
<li><a href="#sec-28-3">28.3. <span class="todo TODO">TODO</span> Create a raster version of 50 foot buffer?</a></li>
<li><a href="#sec-28-4">28.4. <span class="todo TODO">TODO</span> Get Adam to update the parcel info report.</a></li>
<li><a href="#sec-28-5">28.5. <span class="todo TODO">TODO</span> Review the meta data reports that Mike Leathers has generated</a></li>
</ul>
</li>
<li><a href="#sec-29">29. <span class="todo TODO">TODO</span> SMART GOAL: Develop Recorded Plat Lot Database.</a>
<ul>
<li><a href="#sec-29-1">29.1. <span class="todo TODO">TODO</span> Work out and test technologies that may be used</a>
<ul>
<li><a href="#sec-29-1-1">29.1.1. <span class="todo TODO">TODO</span> Create map services on GeoServer serving out PostGIS data</a></li>
</ul>
</li>
<li><a href="#sec-29-2">29.2. <span class="todo TODO">TODO</span> Design and implement database schema</a></li>
<li><a href="#sec-29-3">29.3. <span class="todo TODO">TODO</span> Create web interface for viewing data</a></li>
<li><a href="#sec-29-4">29.4. <span class="todo TODO">TODO</span> Create Web interface for entering data</a></li>
<li><a href="#sec-29-5">29.5. <span class="todo TODO">TODO</span> Create back-end process for posting shape/tabular data</a></li>
<li><a href="#sec-29-6">29.6. <span class="todo TODO">TODO</span> Migrate from KCGIS test server to AWS when pilot project is approved</a></li>
</ul>
</li>
<li><a href="#sec-30">30. <span class="todo TODO">TODO</span> Marina Giloi - respond regarding ZIP code GeoJSON for MS Power BI</a></li>
<li><a href="#sec-31">31. <span class="todo TODO">TODO</span> Conservation Easements</a></li>
<li><a href="#sec-32">32. <span class="todo TODO">TODO</span> Amazon Cloud MRF with Mike Leathers</a></li>
<li><a href="#sec-33">33. <span class="todo TODO">TODO</span> Talk to Toni about ongoing Data update schedule of Marijuana Data</a></li>
<li><a href="#sec-34">34. <span class="todo TODO">TODO</span> Community Service Areas</a>
<ul>
<li><a href="#sec-34-1">34.1. <span class="todo TODO">TODO</span> Write document for model as it exists</a></li>
<li><a href="#sec-34-2">34.2. <span class="todo TODO">TODO</span> Put files in TFS</a></li>
<li><a href="#sec-34-3">34.3. Orphaned Tasks</a>
<ul>
<li><a href="#sec-34-3-1">34.3.1. <span class="todo TODO">TODO</span> Enhance a report that Dave is creating by adding CSA value.</a></li>
<li><a href="#sec-34-3-2">34.3.2. <span class="todo TODO">TODO</span> Add Community Service Areas to GIS<sub>Layers</sub> map service in Prod</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-35">35. <span class="todo TODO">TODO</span> Respond to Christine Jensen</a>
<ul>
<li><a href="#sec-35-1">35.1. <span class="todo TODO">TODO</span> Implement the p-suffix for the adjacent Rainier Ridge?</a></li>
</ul>
</li>
<li><a href="#sec-36">36. <span class="todo TODO">TODO</span> Create Recorded Plat Lot Plan document.</a></li>
<li><a href="#sec-37">37. <span class="todo TODO">TODO</span> SMP changes requested by Laura Casey</a>
<ul>
<li><a href="#sec-37-1">37.1. <span class="todo TODO">TODO</span> Get Jim Chan to contact Mark Isaacson and determine who is responsible and what are the procedures for  updates</a></li>
</ul>
</li>
<li><a href="#sec-38">38. <span class="todo TODO">TODO</span> Figure out KCGIS geocoding service details and put in AVTEST AccelaGIS config.</a></li>
<li><a href="#sec-39">39. <span class="todo TODO">TODO</span> Fix SAO Wetland error - Jen Vanderhoof</a></li>
<li><a href="#sec-40">40. <span class="todo TODO">TODO</span> Fix GIS<sub>Layers</sub> Service Definition file</a></li>
<li><a href="#sec-41">41. <span class="todo TODO">TODO</span> City Layers</a>
<ul>
<li><a href="#sec-41-1">41.1. <span class="todo TODO">TODO</span> Talk to Rey Sugi about the Snoqualmie City boundary</a></li>
<li><a href="#sec-41-2">41.2. <span class="todo TODO">TODO</span> Check out and respond to City of Renton discrepancy #e-mail 1/14/15</a></li>
<li><a href="#sec-41-3">41.3. <span class="todo TODO">TODO</span> Fix City<sub>annex</sub><sub>area</sub> meta data to publish to the data portal</a></li>
<li><a href="#sec-41-4">41.4. <span class="todo TODO">TODO</span> Move failed annexations, etc that are older than the previous calendar year.</a></li>
<li><a href="#sec-41-5">41.5. <span class="todo TODO">TODO</span> Work on Documentation and put it where Mike Leathers is recommending (TFS, directory, Sharepoint)</a></li>
<li><a href="#sec-41-6">41.6. <span class="todo TODO">TODO</span> Send Christie my Documentation</a></li>
<li><a href="#sec-41-7">41.7. <span class="todo TODO">TODO</span> Document the overlays with screen captures and send them to Assessments for review.</a></li>
<li><a href="#sec-41-8">41.8. <span class="todo TODO">TODO</span> Put the Models in TFS</a></li>
</ul>
</li>
<li><a href="#sec-42">42. <span class="todo TODO">TODO</span> Update TDR sending sites</a></li>
<li><a href="#sec-43">43. <span class="todo TODO">TODO</span> Update Vashon Town Plan P-Suffix language from 2014 ordinance - Bradley Clark</a></li>
<li><a href="#sec-44">44. <span class="todo TODO">TODO</span> Create Permitting  Jurisdiction Search</a>
<ul>
<li><a href="#sec-44-1">44.1. Data collection</a>
<ul>
<li><a href="#sec-44-1-1">44.1.1. <span class="todo TODO">TODO</span> Get list of permit types from John Backman</a></li>
<li><a href="#sec-44-1-2">44.1.2. <span class="todo TODO">TODO</span> Ask Peter Isaacson  about septic permits</a></li>
</ul>
</li>
<li><a href="#sec-44-2">44.2. Database enhancement</a>
<ul>
<li><a href="#sec-44-2-1">44.2.1. <span class="todo TODO">TODO</span> Create look-up table(s) to relate agency contact information to GIS Layers</a></li>
<li><a href="#sec-44-2-2">44.2.2. <span class="todo TODO">TODO</span> Collect contact information for all agencies - Work with Connie Carlson</a></li>
</ul>
</li>
<li><a href="#sec-44-3">44.3. Web page development - Work with Adam Cabrera</a></li>
<li><a href="#sec-44-4">44.4. Look at for information</a>
<ul>
<li><a href="#sec-44-4-1">44.4.1. <span class="todo TODO">TODO</span> Determine where on website page will be placed</a></li>
<li><a href="#sec-44-4-2">44.4.2. <span class="todo TODO">TODO</span> Design new web page or section for existing page - Work with John Backman</a></li>
<li><a href="#sec-44-4-3">44.4.3. <span class="todo TODO">TODO</span> Implement design in Districts Report</a></li>
<li><a href="#sec-44-4-4">44.4.4. <span class="todo TODO">TODO</span> QC Testing</a></li>
<li><a href="#sec-44-4-5">44.4.5. <span class="todo TODO">TODO</span> Deploy to production</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-45">45. <span class="todo TODO">TODO</span> GIS Layer of Accela Automation Permits</a>
<ul>
<li><a href="#sec-45-1">45.1. Work with Debbie:</a>
<ul>
<li><a href="#sec-45-1-1">45.1.1. <span class="todo TODO">TODO</span> Get her Oracle Client working</a></li>
<li><a href="#sec-45-1-2">45.1.2. <span class="todo TODO">TODO</span> Get Oracle services working on a server</a></li>
</ul>
</li>
<li><a href="#sec-45-2">45.2. <span class="todo TODO">TODO</span> Establish weekly automated process to clone data from Oracle to MS SQL Server</a></li>
<li><a href="#sec-45-3">45.3. <span class="todo TODO">TODO</span> Write Program to manage point-in-time locked paracel geometry</a></li>
<li><a href="#sec-45-4">45.4. <span class="todo TODO">TODO</span> Establish weekly automated process to join cloned data and point-in-time locked paracel geometry</a></li>
</ul>
</li>
<li><a href="#sec-46">46. <span class="todo TODO">TODO</span> Create AWS copies of plibrary, working w/Debbie Bull</a>
<ul>
<li><a href="#sec-46-1">46.1. PostGIS version</a>
<ul>
<li><a href="#sec-46-1-1">46.1.1. <span class="todo TODO">TODO</span> Determine what AWS resources are needed</a></li>
<li><a href="#sec-46-1-2">46.1.2. <span class="todo TODO">TODO</span> Initialize needed AWS Resources</a></li>
<li><a href="#sec-46-1-3">46.1.3. <span class="todo TODO">TODO</span> Set up Database to receive Plibrary copy</a></li>
<li><a href="#sec-46-1-4">46.1.4. <span class="todo TODO">TODO</span> Import all Plibrary data</a></li>
<li><a href="#sec-46-1-5">46.1.5. <span class="todo TODO">TODO</span> Implment SDE ontop of PostGIS</a></li>
<li><a href="#sec-46-1-6">46.1.6. <span class="todo TODO">TODO</span> Create feature services for public data layers with both state plane and Web Mercator versions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-47">47. <span class="todo TODO">TODO</span> Move data from Regional Planning to Budget@maint</a></li>
<li><a href="#sec-48">48. <span class="todo TODO">TODO</span> Outstanding Accela Issues:</a>
<ul>
<li><a href="#sec-48-1">48.1. <span class="todo TODO">TODO</span> ParcelAddress updates in Accela GIS</a>
<ul>
<li><a href="#sec-48-1-1">48.1.1. <span class="todo TODO">TODO</span> Work with Dave O &amp; Accela to get updates automated. (I have python code, but Debbie has SQL code that can be run in a few seconds.)</a></li>
<li><a href="#sec-48-1-2">48.1.2. <span class="todo TODO">TODO</span> Work with Dave Ostanski to a fully populate Lat &amp; Long fields in ParcelAddress layer</a></li>
</ul>
</li>
<li><a href="#sec-48-2">48.2. <span class="todo TODO">TODO</span> Add the Farm Plan and Forest plan parcels to Accela GIS for Randy Sandin, per conversation.</a></li>
<li><a href="#sec-48-3">48.3. <span class="todo TODO">TODO</span> Ortho Imagery broken/Missing from Accela GIS</a>
<ul>
<li><a href="#sec-48-3-1">48.3.1. <span class="todo TODO">TODO</span> Establish 2015 image service on new internal production server or dedicated image service. Possible to coordinate w/ Assessments.</a></li>
</ul>
</li>
<li><a href="#sec-48-4">48.4. <span class="todo TODO">TODO</span> Multiple Address Issues and condos - Kim Simpson/Stacey Wenkel</a>
<ul>
<li><a href="#sec-48-4-1">48.4.1. <span class="todo TODO">TODO</span> Update Preprod GIS<sub>Layers</sub> to remove no house number address points</a></li>
<li><a href="#sec-48-4-2">48.4.2. <span class="todo TODO">TODO</span> Check PIN = '0922069179' in preprod for 0 housenumbered address<sub>points</sub>.</a></li>
</ul>
</li>
<li><a href="#sec-48-5">48.5. <span class="todo TODO">TODO</span> Switch Base3 to point at plibrary.hydro.CHNLMIGR<sub>area</sub> for Channel Migration Hazard Layer</a></li>
<li><a href="#sec-48-6">48.6. <span class="todo TODO">TODO</span> Enhance Parcel Address to include condo units</a></li>
<li><a href="#sec-48-7">48.7. <span class="todo TODO">TODO</span> Forest Stewardship Plan Layer: See e-mail <span class="timestamp-wrapper"><span class="timestamp">[2014-07-23 Wed]</span></span></a></li>
<li><a href="#sec-48-8">48.8. <span class="todo TODO">TODO</span> Inspector App issue - John Miller #e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-04-24 Fri]</span></span></a></li>
<li><a href="#sec-48-9">48.9. <span class="todo TODO">TODO</span> Address Problem -  Alex Perlman #email <span class="timestamp-wrapper"><span class="timestamp">[2015-04-23 Thu]</span></span></a></li>
<li><a href="#sec-48-10">48.10. <span class="todo TODO">TODO</span> System to Document parcel info such as research findings by staff Jim Chan</a></li>
<li><a href="#sec-48-11">48.11. <span class="todo TODO">TODO</span> Look at geodata services issue here: </a></li>
<li><a href="#sec-48-12">48.12. <span class="todo TODO">TODO</span> John Miller - look into addressing issues #e-mail <span class="timestamp-wrapper"><span class="timestamp">[2014-11-13 Thu]</span></span></a></li>
<li><a href="#sec-48-13">48.13. <span class="todo TODO">TODO</span> Check out Accela GIS extension</a></li>
</ul>
</li>
<li><a href="#sec-49">49. <span class="todo TODO">TODO</span> SUPPER Database Review</a>
<ul>
<li><a href="#sec-49-1">49.1. <span class="todo TODO">TODO</span> Review the feature classes that were moved into Supper that didn't have matching names with layers in plibrary but actually are duplicates of plibrary.</a>
<ul>
<li><a href="#sec-49-1-1">49.1.1. <span class="todo TODO">TODO</span> Compare schema of the identified matches and add to the list used for the following step.</a></li>
</ul>
</li>
<li><a href="#sec-49-2">49.2. <span class="todo TODO">TODO</span> Investigate the feature classes that matched name with feature classes in plibrary but did not have matching schemas.</a>
<ul>
<li><a href="#sec-49-2-1">49.2.1. <span class="todo TODO">TODO</span> Of particular interest any of these that match layers used in map services accessed by Accela GIS.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-50">50. <span class="todo TODO">TODO</span> Comp Plan Data</a>
<ul>
<li><a href="#sec-50-1">50.1. <span class="todo TODO">TODO</span> FPD</a></li>
<li><a href="#sec-50-2">50.2. <span class="todo TODO">TODO</span> APD</a></li>
<li><a href="#sec-50-3">50.3. <span class="todo TODO">TODO</span> UGA</a></li>
<li><a href="#sec-50-4">50.4. <span class="todo TODO">TODO</span> Development Conditions/Sitecore pages:</a>
<ul>
<li><a href="#sec-50-4-1">50.4.1. <span class="todo TODO">TODO</span> Review all 2008 comp plan amendments for P-suffixes</a></li>
<li><a href="#sec-50-4-2">50.4.2. <span class="todo TODO">TODO</span> Description for SO-180</a></li>
<li><a href="#sec-50-4-3">50.4.3. <span class="todo TODO">TODO</span> Title for SO-260. Typo of Business.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-51">51. <span class="todo TODO">TODO</span> Update PAA Data &amp; maps.</a>
<ul>
<li><a href="#sec-51-1">51.1. <span class="todo TODO">TODO</span> Make City PAA orange in iMap</a></li>
<li><a href="#sec-51-2">51.2. <span class="todo TODO">TODO</span> Make changes that Karen indicated via e-mail on <span class="timestamp-wrapper"><span class="timestamp">[2015-02-13 Fri]</span></span></a></li>
<li><a href="#sec-51-3">51.3. <span class="todo TODO">TODO</span> Urban Unincorporated Priority Initiative</a>
<ul>
<li><a href="#sec-51-3-1">51.3.1. <span class="todo TODO">TODO</span> Create a finite list of all areas under investigation</a></li>
<li><a href="#sec-51-3-2">51.3.2. <span class="todo TODO">TODO</span> Update layer and map for County Executive</a></li>
</ul>
</li>
<li><a href="#sec-51-4">51.4. <span class="todo TODO">TODO</span> Make changes to standard PAA map as Karen F indicated via e-mail on <span class="timestamp-wrapper"><span class="timestamp">[2015-03-18 Wed]</span></span></a></li>
<li><a href="#sec-51-5">51.5. <span class="todo TODO">TODO</span> Get buy-off from Karen Freeman</a></li>
<li><a href="#sec-51-6">51.6. <span class="todo TODO">TODO</span> Send to Ray Sugui</a></li>
<li><a href="#sec-51-7">51.7. <span class="todo TODO">TODO</span> Create small area map</a></li>
</ul>
</li>
<li><a href="#sec-52">52. <span class="todo TODO">TODO</span> SMP Designations</a>
<ul>
<li><a href="#sec-52-1">52.1. <span class="todo TODO">TODO</span> Fix the layer file to resolve the problem that Lisa was having with the comp plan map</a></li>
<li><a href="#sec-52-2">52.2. <span class="todo TODO">TODO</span> Fix the layer file to resolve the UGA Line conflict problem, IF IT EXISTS</a></li>
<li><a href="#sec-52-3">52.3. <span class="todo TODO">TODO</span> Fix the Base3 Map service to remove old SMMP layer and name the shoreline layer better(short)</a></li>
<li><a href="#sec-52-4">52.4. <span class="todo TODO">TODO</span> See e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-06-09 Tue 15:26]</span></span></a></li>
</ul>
</li>
<li><a href="#sec-53">53. <span class="todo TODO">TODO</span> Change map services for DPER to reference GISSQLPUB - MJ</a></li>
<li><a href="#sec-54">54. <span class="todo TODO">TODO</span> Update All DPER map services with new FLDPLN<sub>100YR</sub><sub>AREA</sub> layer replacing FLDPLAIN<sub>AREA</sub></a></li>
<li><a href="#sec-55">55. <span class="todo TODO">TODO</span> Fix p-suffix  for ORD # 16595 effective in 2009. Have a copy of the Hearing examiners report</a></li>
<li><a href="#sec-56">56. <span class="todo TODO">TODO</span> Resolve APD question raised by Rey Sugui e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-07-15 Wed]</span></span></a></li>
<li><a href="#sec-57">57. <span class="todo TODO">TODO</span> Council Dist/CSA Map for Lisa Verner - Assigned to Connie</a></li>
<li><a href="#sec-58">58. <span class="todo TODO">TODO</span> iMap Issues</a>
<ul>
<li><a href="#sec-58-1">58.1. <span class="todo TODO">TODO</span> Add Aquatic Area &amp; CAO<sub>Designations</sub> to plibrary, notify MJ</a></li>
<li><a href="#sec-58-2">58.2. <span class="todo TODO">TODO</span> Update and revise openspace description for Growth Pattern</a></li>
</ul>
</li>
<li><a href="#sec-59">59. <span class="todo TODO">TODO</span> Future GISMO Parcel Info Report enchancements</a>
<ul>
<li>
<ul>
<li><a href="#sec-59-0-1">59.0.1. <span class="todo TODO">TODO</span> Implement Assessor's Open Space - Adam</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-60">60. <span class="todo TODO">TODO</span> Complete the close out of UAC<sub>AREA</sub> and create and document COMMUNITY<sub>COUNCIL</sub><sub>AREA</sub></a></li>
<li><a href="#sec-61">61. <span class="todo TODO">TODO</span> Make sure all of the rezones have been implemented #email <span class="timestamp-wrapper"><span class="timestamp">[2014-10-03 Fri]</span></span>from Jim Chan</a>
<ul>
<li><a href="#sec-61-1">61.1. <span class="todo TODO">TODO</span> Talk with Kim Claussen - receive list of rezones 2000-Present</a></li>
<li><a href="#sec-61-2">61.2. <span class="todo TODO">TODO</span> Get list of rezones older than 2000 - pass to Kim for status and zone change.</a></li>
<li><a href="#sec-61-3">61.3. <span class="todo TODO">TODO</span> Check the zoning layer to see if zoning change was made</a></li>
<li><a href="#sec-61-4">61.4. <span class="todo TODO">TODO</span> Research rezones where zoning change was approved but not made</a></li>
</ul>
</li>
<li><a href="#sec-62">62. <span class="todo TODO">TODO</span> Improve 500' buffer mailing list generation by adding STR based addresses to GISMO mailing list</a>
<ul>
<li><a href="#sec-62-1">62.1. <span class="todo TODO">TODO</span> Receive list of STR/Permit Type combinations</a></li>
<li><a href="#sec-62-2">62.2. <span class="todo TODO">TODO</span> Process list to eliminate duplication and simplify logic</a></li>
<li><a href="#sec-62-3">62.3. <span class="todo TODO">TODO</span> Implement in Mailing list report - Adam</a></li>
</ul>
</li>
<li><a href="#sec-63">63. <span class="todo TODO">TODO</span> Setup Zoning History so that users can do research</a>
<ul>
<li><a href="#sec-63-1">63.1. <span class="todo TODO">TODO</span> Organize the zoning history layers in SUPPER database</a></li>
</ul>
</li>
<li><a href="#sec-64">64. <span class="todo TODO">TODO</span> Fix the attributes in STREET<sub>DIRECTION</sub><sub>ZONE</sub></a></li>
<li><a href="#sec-65">65. <span class="todo TODO">TODO</span> Look at Addressing Data from Clifford</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Request for Regional Planning Hours 2015-2016</h2>
<div class="outline-text-2" id="text-1">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-02-13 Mon]</span></span>
</p>
</div>
</div>
