work.org
* DONE send a request to George
  CLOSED: <2017-03-29 Wed 16:53>
  IN: [2017-03-29 Wed]

* DONE Lake Desire Shorline Analysis Betsy
  CLOSED: <2017-03-29 Wed 16:55>
  IN: [2017-03-29 Wed]

* TODO Paratransit Routing
  IN: [2016-11-02 Wed]
** DONE Respond to follow-up questions so Dennis can respond to Tom
   CLOSED: <2017-03-30 Thu 10:27>
   IN: [2017-03-29 Wed]
   
* TODO Request for Mineral sites map.
  IN: [2017-03-24 Fri]
** DONE Respond with custom order information
   CLOSED: [2017-03-30 Thu 14:17] SCHEDULED: <2017-03-30 Thu 09:30>
   CC Dennis. It is a custom data request.

* TODO Review E-mail starting with oldest unread e-mail
  SCHEDULED: <2017-03-30 Thu 17:00>

* TODO Roads updates for Travel Concurrency and MPS
  IN: [2017-03-17 Fri]
** DONE Respond to Jim Ishimaru e-mail
   CLOSED: [2017-03-30 Thu 17:00
   SCHEDULED: <2017-03-30 Thu 10:00>
   IN:[2017-03-29 Wed]
** TODO Call Stacey W and determine if MPS_area code will be removed from Automation scripts
   DEADLINE: <2017-03-31 Fri 9:15>
** TODO Create new map services for Accela GIS
   DEADLINE: <2017-03-31 Fri 9:20>
** TODO Test new map services for Accela GIS
   DEADLINE: <2017-04-04 Tue>
   SCHEDULED: <2017-04-03 Mon 09:20>
** TODO Update map services for Accela GIS Production
   DEADLINE: <2017-04-14 Fri>
** Verify Adam has updated GISMO Parcel Information Report
   DEADLINE: <2017-04-14 Fri>
** Verify District report is updated
   DEADLINE: <2017-04-14 Fri>
** TODO Remove MPS and TCMZONE from Plibrary
   DEADLINE: <2017-04-21 Fri>

* TODO Take the lead on the Address point priority initiative 
** TODO Review the text from the sharepoint site

* TODO Download ArcGIS Pro 1.4 & Desktop 10.4.1
** TODO submit to desktop support people.
    Package for software center - Jason Rove
    Install it on a new machine - Cory
*** TODO Cc george when this gets sent 
*** TODO Ask Cory who else needs to know this information.
** TODO Tell Cory about the ArcGIS Pro 1.4 and put the installer somewhere
** TODO Tell Mary to tell the other people when 10.4.1 is available

* TODO Figure out the PAA layer symbology for iMap

* TODO Vashon Town core analysis/Plan - Brad Clark
  IN: [2016-12-29 Thu]
** DONE Submit sidewalk map to designer
   CLOSED: [2017-03-30 Thu 14:45]
   SCHEDULED: <2017-03-30 Thu 09:45>

* TODO Follow-up on software for new laptops
  DEADLINE: <2017-03-31 Fri 17:00>
** TODO Get back to Cory
   We want to start with Yuko

* TODO Winery Map - Karen Wolf
  IN: [2017-02-03 Fri]
** TODO Second Draft requested sent to DPER staff
   IN: [2017-03-09 Thu]

* TODO Find missing maps for p-suffix conditions - Wendy G
  IN: [2017-03-08 Wed]

* TODO Caroline Boatsman - 206-595-8579
  Mercer island - loss of tree caonpy

* TODO Paul Freeman question about lot. 301-898-2631

* TODO Lisa Verner - Large Parcel analysis
  IN: [2017-01-31 Tue]
  waiting for response to first draft

* TODO Question about Mai's parcels

* TODO Question from Stacey wenkel about not getting GIS in the inspection whatever

* TODO Update parcel_address Layer and key IDs for Accela Automation
  IN: [2017-02-08 Wed]

* TODO Implement the Comp Plan Changes
  SCHEDULED: <2017-03-31 Fri 9:30>
  IN: [2016-12-09 Fri]
** TODO Update UGA
** TODO Update PAA
** TODO Update Complu
** TODO Update Zoning
** TODO Update Development Conditions

* TODO SMART GOAL: Regional Planning Section GIS Work Plan 2017-18
** TODO Prepare a document for the Regional Planning Section
   Expect the maintenance of Comp Plan layers to be split between PSB, DPER, DNRP
*** TODO Create a list of layers and get explicit feed-back on which are maintained by who
     Local Subarea Planning is staying at DPER (Skyway, North Highline, Vashon)
     Include 25th Aniversary GMA info graphic project
     Include CiP topics
