work.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> send a request to George</h2>
<div class="outline-text-2" id="text-2">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-29 Wed]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="done DONE">DONE</span> Lake Desire Shorline Analysis Betsy</h2>
<div class="outline-text-2" id="text-3">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-29 Wed]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Paratransit Routing</h2>
<div class="outline-text-2" id="text-4">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-11-02 Wed]</span></span>
</p>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <span class="done DONE">DONE</span> Respond to follow-up questions so Dennis can respond to Tom</h3>
<div class="outline-text-3" id="text-4-1">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-29 Wed]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Respond to request for Mineral sites map.</h2>
<div class="outline-text-2" id="text-5">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-24 Fri]</span></span>
</p>
<p>
CC Dennis. It is a custom data request.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Roads updates for Travel Concurrency and MPS</h2>
<div class="outline-text-2" id="text-6">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-17 Fri]</span></span>
</p>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> Respond to Jim Ishimaru e-mail</h3>
<div class="outline-text-3" id="text-6-1">
<p>
IN:<span class="timestamp-wrapper"><span class="timestamp">[2017-03-29 Wed]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> <span class="todo TODO">TODO</span> Create new map services for Accela GIS</h3>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> <span class="todo TODO">TODO</span> Test new map services for Accela GIS</h3>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> <span class="todo TODO">TODO</span> Update map services for Accela GIS Production</h3>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Verify Adam has updated GISMO Parcel Information Report</h3>
</div>
<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Verify District report is updated</h3>
</div>
<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> <span class="todo TODO">TODO</span> Remove MPS and TCMZONE from Plibrary</h3>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Take the lead on the Address point priority initiative</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> <span class="todo TODO">TODO</span> Review the text from the sharepoint site</h3>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> Download ArcGIS Pro 1.4 &amp; Desktop 10.4.1</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> <span class="todo TODO">TODO</span> submit to desktop support people.</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Package for software center - Jason Rove
Install it on a new machine - Cory
</p>
</div>
<div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1"><span class="section-number-4">8.1.1</span> <span class="todo TODO">TODO</span> Cc george when this gets sent</h4>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2"><span class="section-number-4">8.1.2</span> <span class="todo TODO">TODO</span> Ask Cory who else needs to know this information.</h4>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> <span class="todo TODO">TODO</span> Tell Cory about the ArcGIS Pro 1.4 and put the installer somewhere</h3>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> <span class="todo TODO">TODO</span> Tell Mary to tell the other people when 10.4.1 is available</h3>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> Figure out the PAA layer symbology for iMap</h2>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> Vashon Town core analysis/Plan - Brad Clark</h2>
<div class="outline-text-2" id="text-10">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-12-29 Thu]</span></span>
</p>
</div>
<div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> <span class="todo TODO">TODO</span> Submit sidewalk map to designer</h3>
<div class="outline-text-3" id="text-10-1">
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <span class="todo TODO">TODO</span> Follow-up on software for new laptops</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> <span class="todo TODO">TODO</span> Get back to Cory</h3>
<div class="outline-text-3" id="text-11-1">
<p>
We want to start with Yuko
</p>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <span class="todo TODO">TODO</span> Winery Map - Karen Wolf</h2>
<div class="outline-text-2" id="text-12">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-02-03 Fri]</span></span>
</p>
</div>
<div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> <span class="todo TODO">TODO</span> Second Draft requested sent to DPER staff</h3>
<div class="outline-text-3" id="text-12-1">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-09 Thu]</span></span>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <span class="todo TODO">TODO</span> Find missing maps for p-suffix conditions - Wendy G</h2>
<div class="outline-text-2" id="text-13">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-03-08 Wed]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <span class="todo TODO">TODO</span> Caroline Boatsman - 206-595-8579</h2>
<div class="outline-text-2" id="text-14">
<p>
Mercer island - loss of tree caonpy
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <span class="todo TODO">TODO</span> Paul Freeman question about lot. 301-898-2631</h2>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <span class="todo TODO">TODO</span> Lisa Verner - Large Parcel analysis</h2>
<div class="outline-text-2" id="text-16">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-01-31 Tue]</span></span>
waiting for response to first draft
</p>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <span class="todo TODO">TODO</span> Question about Mai's parcels</h2>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <span class="todo TODO">TODO</span> Question from Stacey wenkel about not getting GIS in the inspection whatever</h2>
</div>

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <span class="todo TODO">TODO</span> Update parcel<sub>address</sub> Layer and key IDs for Accela Automation</h2>
<div class="outline-text-2" id="text-19">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2017-02-08 Wed]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <span class="todo TODO">TODO</span> Implement the Comp Plan Changes</h2>
<div class="outline-text-2" id="text-20">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-12-09 Fri]</span></span>
</p>
</div>
<div id="outline-container-sec-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> <span class="todo TODO">TODO</span> Update UGA</h3>
</div>
<div id="outline-container-sec-20-2" class="outline-3">
<h3 id="sec-20-2"><span class="section-number-3">20.2</span> <span class="todo TODO">TODO</span> Update PAA</h3>
</div>
<div id="outline-container-sec-20-3" class="outline-3">
<h3 id="sec-20-3"><span class="section-number-3">20.3</span> <span class="todo TODO">TODO</span> Update Complu</h3>
</div>
<div id="outline-container-sec-20-4" class="outline-3">
<h3 id="sec-20-4"><span class="section-number-3">20.4</span> <span class="todo TODO">TODO</span> Update Zoning</h3>
</div>
<div id="outline-container-sec-20-5" class="outline-3">
<h3 id="sec-20-5"><span class="section-number-3">20.5</span> <span class="todo TODO">TODO</span> Update Development Conditions</h3>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <span class="todo TODO">TODO</span> SMART GOAL: Regional Planning Section GIS Work Plan 2017-18</h2>
<div class="outline-text-2" id="text-21">
</div><div id="outline-container-sec-21-1" class="outline-3">
<h3 id="sec-21-1"><span class="section-number-3">21.1</span> <span class="todo TODO">TODO</span> Prepare a document for the Regional Planning Section</h3>
<div class="outline-text-3" id="text-21-1">
<p>
Expect the maintenance of Comp Plan layers to be split between PSB, DPER, DNRP
</p>
</div>
<div id="outline-container-sec-21-1-1" class="outline-4">
<h4 id="sec-21-1-1"><span class="section-number-4">21.1.1</span> <span class="todo TODO">TODO</span> Create a list of layers and get explicit feed-back on which are maintained by who</h4>
<div class="outline-text-4" id="text-21-1-1">
<p>
Local Subarea Planning is staying at DPER (Skyway, North Highline, Vashon)
Include 25th Aniversary GMA info graphic project
Include CiP topics
</p>
</div>
</div>
</div>
