work.org
** TODO Get written acceptance of work plan from Lauren Smith or her designee.
** TODO Schedule a time that Dennis and I can present to the Regional Planning Staff
   Contact Chandler First

* TODO SMART GOAL: Establish and create a document describing a new KCGIS governance process for spatial data warehouse layer maintenance prioritization and tracking.
  DEADLINE: <2017-07-01 Sat>
** Features:
   Identify the geographic information framework layers
   track layer update frequencies
   allow the GIS Steering Committee to prioritize layers to receive update efforts as part of the KCGIS Center's operations program. 

* TODO SMART GOAL: Add 3 more counties to City_3co_jurisdiction layer at the request of transit.
  IN:  [2015-03-02 Mon]
** DONE Obtain feed-back from Gunnar
   CLOSED: <2017-02-17 11:31>
** TODO Complete functional model
** TODO Complete functional python script
** TODO Post new layers
** TODO Retire old layers

* TODO SMART GOAL: Tribal Lands
** TODO Create new layer in library control file
   Possible Name = Regional_Reservation_AREA - wait for input from Bob Peterson

* TODO Change request for installing javascript accela gis
  SCHEDULED: <2017-04-03 Mon 14:00>
** TODO Send questions to Accela
** TODO Figure out database

* TODO Look into Council zoning ordinance e-mail [2016-11-09 Wed] report back to Christie
  See e-mail from Erin (council staff)

* TODO Wictor lady e-mail [2016-11-09 Wed]

* TODO SMART GOAL: Publish Steep Slope & Landslide Hazard Layers for DPER
  IN: [2015-11-18 Wed]
** TODO Greg Wessel - Fix the Steep Slopes Area to include missing portions
   IN: [2016-10-07 Fri]
** TODO Fix the Services Directory Description to include the proper links
** TODO Create a raster version of 50 foot buffer?
   See map service HK published for DNRP.
** TODO Get Adam to update the parcel info report.
** TODO Review the meta data reports that Mike Leathers has generated

* TODO SMART GOAL: Develop Recorded Plat Lot Database.
** TODO Work out and test technologies that may be used
*** TODO Create map services on GeoServer serving out PostGIS data
** TODO Design and implement database schema
** TODO Create web interface for viewing data
** TODO Create Web interface for entering data
   Functions for posting  tabular data
   Functions for registering scanned plat map
   Functions for creating  lots from existing Parcel polygons
   Functions for posting shape data
** TODO Create back-end process for posting shape/tabular data
** TODO Migrate from KCGIS test server to AWS when pilot project is approved

* TODO Marina Giloi - respond regarding ZIP code GeoJSON for MS Power BI
  IN: [2016-10-07 Fri]

* TODO Conservation Easements
  IN: [2015-11-13 Fri]
  Find out if DPER needs the ownership information
  Find out which layers DPER needs reported in the parcel information report
  Talk to Todd Klinka about how it may relate to his stuff.
  Get information to Adam
  Find out if/how/how long of text can be inserted into Automation as a parcel flag.

* TODO Amazon Cloud MRF with Mike Leathers

* TODO Talk to Toni about ongoing Data update schedule of Marijuana Data
  Put it in Plibrary?
  Available only internally?

* TODO Community Service Areas
** TODO Write document for model as it exists
** TODO Put files in TFS
** Orphaned Tasks
*** TODO Enhance a report that Dave is creating by adding CSA value.
*** TODO Add Community Service Areas to GIS_Layers map service in Prod

* TODO Respond to Christine Jensen
** TODO Implement the p-suffix for the adjacent Rainier Ridge?
  It seems that L98RZ006 (Ordinance # 13755 - TR-P48) wasn't
implemented in the zoning layer until 3 months after the area zoning
map was produced for the comp plan amendment.
  See e-mails sent in May 2014.

* TODO Create Recorded Plat Lot Plan document.
  IN: [2016-03-11 Fri]

