work.html
<div id="outline-container-sec-21-2" class="outline-3">
<h3 id="sec-21-2"><span class="section-number-3">21.2</span> <span class="todo TODO">TODO</span> Get written acceptance of work plan from Lauren Smith or her designee.</h3>
</div>
<div id="outline-container-sec-21-3" class="outline-3">
<h3 id="sec-21-3"><span class="section-number-3">21.3</span> <span class="todo TODO">TODO</span> Schedule a time that Dennis and I can present to the Regional Planning Staff</h3>
<div class="outline-text-3" id="text-21-3">
<p>
Contact Chandler First
</p>
</div>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <span class="todo TODO">TODO</span> SMART GOAL: Establish and create a document describing a new KCGIS governance process for spatial data warehouse layer maintenance prioritization and tracking, before July 2017, which will identify geographic information framework layers, track layer update frequencies, and allow the GIS Steering Committee to prioritize layers to receive update efforts as part of the KCGIS Center's operations program.</h2>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <span class="todo TODO">TODO</span> SMART GOAL: Add 3 more counties to City<sub>3co</sub><sub>jurisdiction</sub> layer at the request of transit. IN 3/2/15</h2>
<div class="outline-text-2" id="text-23">
</div><div id="outline-container-sec-23-1" class="outline-3">
<h3 id="sec-23-1"><span class="section-number-3">23.1</span> <span class="done DONE">DONE</span> Obtain feed-back from Gunnar</h3>
<div class="outline-text-3" id="text-23-1">
</div>
</div>
<div id="outline-container-sec-23-2" class="outline-3">
<h3 id="sec-23-2"><span class="section-number-3">23.2</span> <span class="todo TODO">TODO</span> Complete functional model</h3>
</div>
<div id="outline-container-sec-23-3" class="outline-3">
<h3 id="sec-23-3"><span class="section-number-3">23.3</span> <span class="todo TODO">TODO</span> Complete functional python script</h3>
</div>
<div id="outline-container-sec-23-4" class="outline-3">
<h3 id="sec-23-4"><span class="section-number-3">23.4</span> <span class="todo TODO">TODO</span> Post new layers</h3>
</div>
<div id="outline-container-sec-23-5" class="outline-3">
<h3 id="sec-23-5"><span class="section-number-3">23.5</span> <span class="todo TODO">TODO</span> Retire old layers</h3>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <span class="todo TODO">TODO</span> SMART GOAL: Tribal Lands</h2>
<div class="outline-text-2" id="text-24">
</div><div id="outline-container-sec-24-1" class="outline-3">
<h3 id="sec-24-1"><span class="section-number-3">24.1</span> <span class="todo TODO">TODO</span> Create new layer in library control file</h3>
<div class="outline-text-3" id="text-24-1">
<p>
Possible Name = Regional<sub>Reservation</sub><sub>AREA</sub> - wait for input from Bob Peterson
</p>
</div>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <span class="todo TODO">TODO</span> Change request for installing javascript accela gis</h2>
<div class="outline-text-2" id="text-25">
</div>
<div id="outline-container-sec-25-1" class="outline-3">
<h3 id="sec-25-1"><span class="section-number-3">25.1</span> <span class="todo TODO">TODO</span> Send questions to Accela</h3>
</div>
<div id="outline-container-sec-25-2" class="outline-3">
<h3 id="sec-25-2"><span class="section-number-3">25.2</span> <span class="todo TODO">TODO</span> Figure out database</h3>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <span class="todo TODO">TODO</span> Look into Council zoning ordinance e-mail 11/9/16 report back to Christie</h2>
<div class="outline-text-2" id="text-26">
<p>
See e-mail from Erin (council staff)
</p>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <span class="todo TODO">TODO</span> Wictor lady e-mail 11/9/16</h2>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <span class="todo TODO">TODO</span> SMART GOAL: Publish Steep Slope &amp; Landslide Hazard Layers for DPER</h2>
<div class="outline-text-2" id="text-28">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-11-18 Wed]</span></span>
</p>
</div>
<div id="outline-container-sec-28-1" class="outline-3">
<h3 id="sec-28-1"><span class="section-number-3">28.1</span> <span class="todo TODO">TODO</span> Greg Wessel - Fix the Steep Slopes Area to include missing portions</h3>
<div class="outline-text-3" id="text-28-1">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-10-07 Fri]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-28-2" class="outline-3">
<h3 id="sec-28-2"><span class="section-number-3">28.2</span> <span class="todo TODO">TODO</span> Fix the Services Directory Description to include the proper links</h3>
</div>
<div id="outline-container-sec-28-3" class="outline-3">
<h3 id="sec-28-3"><span class="section-number-3">28.3</span> <span class="todo TODO">TODO</span> Create a raster version of 50 foot buffer?</h3>
<div class="outline-text-3" id="text-28-3">
<p>
See map service HK published for DNRP.
</p>
</div>
</div>
<div id="outline-container-sec-28-4" class="outline-3">
<h3 id="sec-28-4"><span class="section-number-3">28.4</span> <span class="todo TODO">TODO</span> Get Adam to update the parcel info report.</h3>
</div>
<div id="outline-container-sec-28-5" class="outline-3">
<h3 id="sec-28-5"><span class="section-number-3">28.5</span> <span class="todo TODO">TODO</span> Review the meta data reports that Mike Leathers has generated</h3>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <span class="todo TODO">TODO</span> SMART GOAL: Develop Recorded Plat Lot Database.</h2>
<div class="outline-text-2" id="text-29">
</div><div id="outline-container-sec-29-1" class="outline-3">
<h3 id="sec-29-1"><span class="section-number-3">29.1</span> <span class="todo TODO">TODO</span> Work out and test technologies that may be used</h3>
<div class="outline-text-3" id="text-29-1">
</div><div id="outline-container-sec-29-1-1" class="outline-4">
<h4 id="sec-29-1-1"><span class="section-number-4">29.1.1</span> <span class="todo TODO">TODO</span> Create map services on GeoServer serving out PostGIS data</h4>
</div>
</div>
<div id="outline-container-sec-29-2" class="outline-3">
<h3 id="sec-29-2"><span class="section-number-3">29.2</span> <span class="todo TODO">TODO</span> Design and implement database schema</h3>
</div>
<div id="outline-container-sec-29-3" class="outline-3">
<h3 id="sec-29-3"><span class="section-number-3">29.3</span> <span class="todo TODO">TODO</span> Create web interface for viewing data</h3>
</div>
<div id="outline-container-sec-29-4" class="outline-3">
<h3 id="sec-29-4"><span class="section-number-3">29.4</span> <span class="todo TODO">TODO</span> Create Web interface for entering data</h3>
<div class="outline-text-3" id="text-29-4">
<p>
Functions for posting  tabular data
Functions for registering scanned plat map
Functions for creating  lots from existing Parcel polygons
Functions for posting shape data
</p>
</div>
</div>
<div id="outline-container-sec-29-5" class="outline-3">
<h3 id="sec-29-5"><span class="section-number-3">29.5</span> <span class="todo TODO">TODO</span> Create back-end process for posting shape/tabular data</h3>
</div>
<div id="outline-container-sec-29-6" class="outline-3">
<h3 id="sec-29-6"><span class="section-number-3">29.6</span> <span class="todo TODO">TODO</span> Migrate from KCGIS test server to AWS when pilot project is approved</h3>
</div>
</div>

<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30"><span class="section-number-2">30</span> <span class="todo TODO">TODO</span> Marina Giloi - respond regarding ZIP code GeoJSON for MS Power BI</h2>
<div class="outline-text-2" id="text-30">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-10-07 Fri]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31"><span class="section-number-2">31</span> <span class="todo TODO">TODO</span> Conservation Easements</h2>
<div class="outline-text-2" id="text-31">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-11-13 Fri]</span></span>
Find out if DPER needs the ownership information
Find out which layers DPER needs reported in the parcel information report
Talk to Todd Klinka about how it may relate to his stuff.
Get information to Adam
Find out if/how/how long of text can be inserted into Automation as a parcel flag.
</p>
</div>
</div>

<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32"><span class="section-number-2">32</span> <span class="todo TODO">TODO</span> Amazon Cloud MRF with Mike Leathers</h2>
</div>

<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33"><span class="section-number-2">33</span> <span class="todo TODO">TODO</span> Talk to Toni about ongoing Data update schedule of Marijuana Data</h2>
<div class="outline-text-2" id="text-33">
<p>
Put it in Plibrary?
Available only internally?
</p>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34"><span class="section-number-2">34</span> <span class="todo TODO">TODO</span> Community Service Areas</h2>
<div class="outline-text-2" id="text-34">
</div><div id="outline-container-sec-34-1" class="outline-3">
<h3 id="sec-34-1"><span class="section-number-3">34.1</span> <span class="todo TODO">TODO</span> Write document for model as it exists</h3>
</div>
<div id="outline-container-sec-34-2" class="outline-3">
<h3 id="sec-34-2"><span class="section-number-3">34.2</span> <span class="todo TODO">TODO</span> Put files in TFS</h3>
</div>
<div id="outline-container-sec-34-3" class="outline-3">
<h3 id="sec-34-3"><span class="section-number-3">34.3</span> Orphaned Tasks</h3>
<div class="outline-text-3" id="text-34-3">
</div><div id="outline-container-sec-34-3-1" class="outline-4">
<h4 id="sec-34-3-1"><span class="section-number-4">34.3.1</span> <span class="todo TODO">TODO</span> Enhance a report that Dave is creating by adding CSA value.</h4>
</div>
<div id="outline-container-sec-34-3-2" class="outline-4">
<h4 id="sec-34-3-2"><span class="section-number-4">34.3.2</span> <span class="todo TODO">TODO</span> Add Community Service Areas to GIS<sub>Layers</sub> map service in Prod</h4>
</div>
</div>
</div>

<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35"><span class="section-number-2">35</span> <span class="todo TODO">TODO</span> Respond to Christine Jensen</h2>
<div class="outline-text-2" id="text-35">
</div><div id="outline-container-sec-35-1" class="outline-3">
<h3 id="sec-35-1"><span class="section-number-3">35.1</span> <span class="todo TODO">TODO</span> Implement the p-suffix for the adjacent Rainier Ridge?</h3>
<div class="outline-text-3" id="text-35-1">
<p>
  It seems that L98RZ006 (Ordinance # 13755 - TR-P48) wasn't
implemented in the zoning layer until 3 months after the area zoning
map was produced for the comp plan amendment.
  See e-mails sent in May 2014.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36"><span class="section-number-2">36</span> <span class="todo TODO">TODO</span> Create Recorded Plat Lot Plan document.</h2>
<div class="outline-text-2" id="text-36">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-03-11 Fri]</span></span>
</p>
</div>
</div>
