work.org
* TODO SMP changes requested by Laura Casey
** TODO Get Jim Chan to contact Mark Isaacson and determine who is responsible and what are the procedures for  updates
Laura e-mail
Lake Washington between Renton and Bellevue?

* TODO Figure out KCGIS geocoding service details and put in AVTEST AccelaGIS config.

* TODO Fix SAO Wetland error - Jen Vanderhoof
  IN: [2015-12-19 Sat]

* TODO Fix GIS_Layers Service Definition file
  IN: [2016-01-21 Thu]

* TODO City Layers
** TODO Talk to Rey Sugi about the Snoqualmie City boundary
** TODO Check out and respond to City of Renton discrepancy #e-mail 1/14/15
** TODO Fix City_annex_area meta data to publish to the data portal
** TODO Move failed annexations, etc that are older than the previous calendar year.
** TODO Work on Documentation and put it where Mike Leathers is recommending (TFS, directory, Sharepoint)
** TODO Send Christie my Documentation
** TODO Document the overlays with screen captures and send them to Assessments for review.
** TODO Put the Models in TFS

* TODO Update TDR sending sites
  IN: [2015-11-17 Tue]

* TODO Update Vashon Town Plan P-Suffix language from 2014 ordinance - Bradley Clark
  IN:[2016-02-01 Mon]

* TODO Create Permitting  Jurisdiction Search
  Look at paper notes [2014-02-26 Wed]
** Data collection
*** TODO Get list of permit types from John Backman
*** TODO Ask Peter Isaacson  about septic permits
** Database enhancement
*** TODO Create look-up table(s) to relate agency contact information to GIS Layers
*** TODO Collect contact information for all agencies - Work with Connie Carlson
** Web page development - Work with Adam Cabrera
** Look at http://www.mybuildingpermit.com/ for information
*** TODO Determine where on website page will be placed
*** TODO Design new web page or section for existing page - Work with John Backman
*** TODO Implement design in Districts Report
*** TODO QC Testing
*** TODO Deploy to production

* TODO GIS Layer of Accela Automation Permits
** Work with Debbie:
*** TODO Get her Oracle Client working
*** TODO Get Oracle services working on a server
** TODO Establish weekly automated process to clone data from Oracle to MS SQL Server
** TODO Write Program to manage point-in-time locked paracel geometry
** TODO Establish weekly automated process to join cloned data and point-in-time locked paracel geometry

* TODO Create AWS copies of plibrary, working w/Debbie Bull
** PostGIS version
*** TODO Determine what AWS resources are needed
*** TODO Initialize needed AWS Resources
*** TODO Set up Database to receive Plibrary copy
*** TODO Import all Plibrary data
*** TODO Implment SDE ontop of PostGIS
*** TODO Create feature services for public data layers with both state plane and Web Mercator versions

* TODO Move data from Regional Planning to Budget@maint

* TODO Outstanding Accela Issues:
** TODO ParcelAddress updates in Accela GIS
*** TODO Work with Dave O & Accela to get updates automated. (I have python code, but Debbie has SQL code that can be run in a few seconds.)
*** TODO Work with Dave Ostanski to a fully populate Lat & Long fields in ParcelAddress layer
