work.html

<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37"><span class="section-number-2">37</span> <span class="todo TODO">TODO</span> SMP changes requested by Laura Casey</h2>
<div class="outline-text-2" id="text-37">
</div><div id="outline-container-sec-37-1" class="outline-3">
<h3 id="sec-37-1"><span class="section-number-3">37.1</span> <span class="todo TODO">TODO</span> Get Jim Chan to contact Mark Isaacson and determine who is responsible and what are the procedures for  updates</h3>
<div class="outline-text-3" id="text-37-1">
<p>
Laura e-mail
Lake Washington between Renton and Bellevue?
</p>
</div>
</div>
</div>

<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38"><span class="section-number-2">38</span> <span class="todo TODO">TODO</span> Figure out KCGIS geocoding service details and put in AVTEST AccelaGIS config.</h2>
</div>

<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39"><span class="section-number-2">39</span> <span class="todo TODO">TODO</span> Fix SAO Wetland error - Jen Vanderhoof</h2>
<div class="outline-text-2" id="text-39">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-12-19 Sat]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40"><span class="section-number-2">40</span> <span class="todo TODO">TODO</span> Fix GIS<sub>Layers</sub> Service Definition file</h2>
<div class="outline-text-2" id="text-40">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2016-01-21 Thu]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41"><span class="section-number-2">41</span> <span class="todo TODO">TODO</span> City Layers</h2>
<div class="outline-text-2" id="text-41">
</div><div id="outline-container-sec-41-1" class="outline-3">
<h3 id="sec-41-1"><span class="section-number-3">41.1</span> <span class="todo TODO">TODO</span> Talk to Rey Sugi about the Snoqualmie City boundary</h3>
</div>
<div id="outline-container-sec-41-2" class="outline-3">
<h3 id="sec-41-2"><span class="section-number-3">41.2</span> <span class="todo TODO">TODO</span> Check out and respond to City of Renton discrepancy #e-mail 1/14/15</h3>
</div>
<div id="outline-container-sec-41-3" class="outline-3">
<h3 id="sec-41-3"><span class="section-number-3">41.3</span> <span class="todo TODO">TODO</span> Fix City<sub>annex</sub><sub>area</sub> meta data to publish to the data portal</h3>
</div>
<div id="outline-container-sec-41-4" class="outline-3">
<h3 id="sec-41-4"><span class="section-number-3">41.4</span> <span class="todo TODO">TODO</span> Move failed annexations, etc that are older than the previous calendar year.</h3>
</div>
<div id="outline-container-sec-41-5" class="outline-3">
<h3 id="sec-41-5"><span class="section-number-3">41.5</span> <span class="todo TODO">TODO</span> Work on Documentation and put it where Mike Leathers is recommending (TFS, directory, Sharepoint)</h3>
</div>
<div id="outline-container-sec-41-6" class="outline-3">
<h3 id="sec-41-6"><span class="section-number-3">41.6</span> <span class="todo TODO">TODO</span> Send Christie my Documentation</h3>
</div>
<div id="outline-container-sec-41-7" class="outline-3">
<h3 id="sec-41-7"><span class="section-number-3">41.7</span> <span class="todo TODO">TODO</span> Document the overlays with screen captures and send them to Assessments for review.</h3>
</div>
<div id="outline-container-sec-41-8" class="outline-3">
<h3 id="sec-41-8"><span class="section-number-3">41.8</span> <span class="todo TODO">TODO</span> Put the Models in TFS</h3>
</div>
</div>

<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42"><span class="section-number-2">42</span> <span class="todo TODO">TODO</span> Update TDR sending sites</h2>
<div class="outline-text-2" id="text-42">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-11-17 Tue]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43"><span class="section-number-2">43</span> <span class="todo TODO">TODO</span> Update Vashon Town Plan P-Suffix language from 2014 ordinance - Bradley Clark</h2>
<div class="outline-text-2" id="text-43">
<p>
IN:<span class="timestamp-wrapper"><span class="timestamp">[2016-02-01 Mon]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44"><span class="section-number-2">44</span> <span class="todo TODO">TODO</span> Create Permitting  Jurisdiction Search</h2>
<div class="outline-text-2" id="text-44">
<p>
Look at paper notes <span class="timestamp-wrapper"><span class="timestamp">[2014-02-26 Wed]</span></span>
</p>
</div>
<div id="outline-container-sec-44-1" class="outline-3">
<h3 id="sec-44-1"><span class="section-number-3">44.1</span> Data collection</h3>
<div class="outline-text-3" id="text-44-1">
</div><div id="outline-container-sec-44-1-1" class="outline-4">
<h4 id="sec-44-1-1"><span class="section-number-4">44.1.1</span> <span class="todo TODO">TODO</span> Get list of permit types from John Backman</h4>
</div>
<div id="outline-container-sec-44-1-2" class="outline-4">
<h4 id="sec-44-1-2"><span class="section-number-4">44.1.2</span> <span class="todo TODO">TODO</span> Ask Peter Isaacson  about septic permits</h4>
</div>
</div>
<div id="outline-container-sec-44-2" class="outline-3">
<h3 id="sec-44-2"><span class="section-number-3">44.2</span> Database enhancement</h3>
<div class="outline-text-3" id="text-44-2">
</div><div id="outline-container-sec-44-2-1" class="outline-4">
<h4 id="sec-44-2-1"><span class="section-number-4">44.2.1</span> <span class="todo TODO">TODO</span> Create look-up table(s) to relate agency contact information to GIS Layers</h4>
</div>
<div id="outline-container-sec-44-2-2" class="outline-4">
<h4 id="sec-44-2-2"><span class="section-number-4">44.2.2</span> <span class="todo TODO">TODO</span> Collect contact information for all agencies - Work with Connie Carlson</h4>
</div>
</div>
<div id="outline-container-sec-44-3" class="outline-3">
<h3 id="sec-44-3"><span class="section-number-3">44.3</span> Web page development - Work with Adam Cabrera</h3>
</div>
<div id="outline-container-sec-44-4" class="outline-3">
<h3 id="sec-44-4"><span class="section-number-3">44.4</span> Look at <a href="http://www.mybuildingpermit.com/">http://www.mybuildingpermit.com/</a> for information</h3>
<div class="outline-text-3" id="text-44-4">
</div><div id="outline-container-sec-44-4-1" class="outline-4">
<h4 id="sec-44-4-1"><span class="section-number-4">44.4.1</span> <span class="todo TODO">TODO</span> Determine where on website page will be placed</h4>
</div>
<div id="outline-container-sec-44-4-2" class="outline-4">
<h4 id="sec-44-4-2"><span class="section-number-4">44.4.2</span> <span class="todo TODO">TODO</span> Design new web page or section for existing page - Work with John Backman</h4>
</div>
<div id="outline-container-sec-44-4-3" class="outline-4">
<h4 id="sec-44-4-3"><span class="section-number-4">44.4.3</span> <span class="todo TODO">TODO</span> Implement design in Districts Report</h4>
</div>
<div id="outline-container-sec-44-4-4" class="outline-4">
<h4 id="sec-44-4-4"><span class="section-number-4">44.4.4</span> <span class="todo TODO">TODO</span> QC Testing</h4>
</div>
<div id="outline-container-sec-44-4-5" class="outline-4">
<h4 id="sec-44-4-5"><span class="section-number-4">44.4.5</span> <span class="todo TODO">TODO</span> Deploy to production</h4>
</div>
</div>
</div>

<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45"><span class="section-number-2">45</span> <span class="todo TODO">TODO</span> GIS Layer of Accela Automation Permits</h2>
<div class="outline-text-2" id="text-45">
</div><div id="outline-container-sec-45-1" class="outline-3">
<h3 id="sec-45-1"><span class="section-number-3">45.1</span> Work with Debbie:</h3>
<div class="outline-text-3" id="text-45-1">
</div><div id="outline-container-sec-45-1-1" class="outline-4">
<h4 id="sec-45-1-1"><span class="section-number-4">45.1.1</span> <span class="todo TODO">TODO</span> Get her Oracle Client working</h4>
</div>
<div id="outline-container-sec-45-1-2" class="outline-4">
<h4 id="sec-45-1-2"><span class="section-number-4">45.1.2</span> <span class="todo TODO">TODO</span> Get Oracle services working on a server</h4>
</div>
</div>
<div id="outline-container-sec-45-2" class="outline-3">
<h3 id="sec-45-2"><span class="section-number-3">45.2</span> <span class="todo TODO">TODO</span> Establish weekly automated process to clone data from Oracle to MS SQL Server</h3>
</div>
<div id="outline-container-sec-45-3" class="outline-3">
<h3 id="sec-45-3"><span class="section-number-3">45.3</span> <span class="todo TODO">TODO</span> Write Program to manage point-in-time locked paracel geometry</h3>
</div>
<div id="outline-container-sec-45-4" class="outline-3">
<h3 id="sec-45-4"><span class="section-number-3">45.4</span> <span class="todo TODO">TODO</span> Establish weekly automated process to join cloned data and point-in-time locked paracel geometry</h3>
</div>
</div>

<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46"><span class="section-number-2">46</span> <span class="todo TODO">TODO</span> Create AWS copies of plibrary, working w/Debbie Bull</h2>
<div class="outline-text-2" id="text-46">
</div><div id="outline-container-sec-46-1" class="outline-3">
<h3 id="sec-46-1"><span class="section-number-3">46.1</span> PostGIS version</h3>
<div class="outline-text-3" id="text-46-1">
</div><div id="outline-container-sec-46-1-1" class="outline-4">
<h4 id="sec-46-1-1"><span class="section-number-4">46.1.1</span> <span class="todo TODO">TODO</span> Determine what AWS resources are needed</h4>
</div>
<div id="outline-container-sec-46-1-2" class="outline-4">
<h4 id="sec-46-1-2"><span class="section-number-4">46.1.2</span> <span class="todo TODO">TODO</span> Initialize needed AWS Resources</h4>
</div>
<div id="outline-container-sec-46-1-3" class="outline-4">
<h4 id="sec-46-1-3"><span class="section-number-4">46.1.3</span> <span class="todo TODO">TODO</span> Set up Database to receive Plibrary copy</h4>
</div>
<div id="outline-container-sec-46-1-4" class="outline-4">
<h4 id="sec-46-1-4"><span class="section-number-4">46.1.4</span> <span class="todo TODO">TODO</span> Import all Plibrary data</h4>
</div>
<div id="outline-container-sec-46-1-5" class="outline-4">
<h4 id="sec-46-1-5"><span class="section-number-4">46.1.5</span> <span class="todo TODO">TODO</span> Implment SDE ontop of PostGIS</h4>
</div>
<div id="outline-container-sec-46-1-6" class="outline-4">
<h4 id="sec-46-1-6"><span class="section-number-4">46.1.6</span> <span class="todo TODO">TODO</span> Create feature services for public data layers with both state plane and Web Mercator versions</h4>
</div>
</div>
</div>

<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47"><span class="section-number-2">47</span> <span class="todo TODO">TODO</span> Move data from Regional Planning to Budget@maint</h2>
</div>

<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48"><span class="section-number-2">48</span> <span class="todo TODO">TODO</span> Outstanding Accela Issues:</h2>
<div class="outline-text-2" id="text-48">
</div><div id="outline-container-sec-48-1" class="outline-3">
<h3 id="sec-48-1"><span class="section-number-3">48.1</span> <span class="todo TODO">TODO</span> ParcelAddress updates in Accela GIS</h3>
<div class="outline-text-3" id="text-48-1">
</div><div id="outline-container-sec-48-1-1" class="outline-4">
<h4 id="sec-48-1-1"><span class="section-number-4">48.1.1</span> <span class="todo TODO">TODO</span> Work with Dave O &amp; Accela to get updates automated. (I have python code, but Debbie has SQL code that can be run in a few seconds.)</h4>
</div>
