work.org
** TODO Add the Farm Plan and Forest plan parcels to Accela GIS for Randy Sandin, per conversation.
   IN: [2014-06-11 Wed]
   No Notes.
   See Todd Klinka e-mail [2014-06-11 Wed]
** TODO Ortho Imagery broken/Missing from Accela GIS
   IN: [2015-09-14 Mon]
   MJ took them all down to try to improve server performance.
*** TODO Establish 2015 image service on new internal production server or dedicated image service. Possible to coordinate w/ Assessments.
** TODO Multiple Address Issues and condos - Kim Simpson/Stacey Wenkel
   IN: [2015-07-30 Thu]
*** TODO Update Preprod GIS_Layers to remove no house number address points
*** TODO Check PIN = '0922069179' in preprod for 0 housenumbered address_points.
** TODO Switch Base3 to point at plibrary.hydro.CHNLMIGR_area for Channel Migration Hazard Layer
** TODO Enhance Parcel Address to include condo units
   IN: [2015-08-12 Wed]
** TODO Forest Stewardship Plan Layer: See e-mail [2014-07-23 Wed]
** TODO Inspector App issue - John Miller #e-mail [2015-04-24 Fri]
** TODO  Address Problem -  Alex Perlman #email [2015-04-23 Thu]
** TODO System to Document parcel info such as research findings by staff Jim Chan
   IN:[2015-03-10 Tue]
** TODO Look at geodata services issue here: http://resources.arcgis.com/en/help/main/10.1/index.html#//0154000004s0000000
** TODO John Miller - look into addressing issues #e-mail [2014-11-13 Thu]
** TODO Check out Accela GIS extension

* TODO SUPPER Database Review
** TODO Review the feature classes that were moved into Supper that didn't have matching names with layers in plibrary but actually are duplicates of plibrary.
*** TODO Compare schema of the identified matches and add to the list used for the following step.
** TODO Investigate the feature classes that matched name with feature classes in plibrary but did not have matching schemas. 
*** TODO Of particular interest any of these that match layers used in map services accessed by Accela GIS.

* TODO Comp Plan Data
  IN: [2015-11-03 Tue]
  Publish layers edited to support 2016 comp plan maps
** TODO FPD
** TODO APD
** TODO UGA
** TODO Development Conditions/Sitecore pages:
*** TODO Review all 2008 comp plan amendments for P-suffixes
*** TODO Description for SO-180
*** TODO Title for SO-260. Typo of Business.

* TODO Update PAA Data & maps.
  SCHEDULED: <2017-03-31 Fri 10:00>
** TODO  Make City PAA orange in iMap
   IN: [2015-06-11 Thu]
** TODO Make changes that Karen indicated via e-mail on [2015-02-13 Fri]
** TODO Urban Unincorporated Priority Initiative 
*** TODO Create a finite list of all areas under investigation
**** TODO Review City_Annex_Area. There is one in Northbend.
*** TODO Update layer and map for County Executive
    Look in Paper notes [2015-06-11 Thu]
** TODO Make changes to standard PAA map as Karen F indicated via e-mail on [2015-03-18 Wed]
** TODO Get buy-off from Karen Freeman
** TODO Send to Ray Sugui
** TODO Create small area map

* TODO SMP Designations
** TODO Fix the layer file to resolve the problem that Lisa was having with the comp plan map
** TODO Fix the layer file to resolve the UGA Line conflict problem, IF IT EXISTS
** TODO Fix the Base3 Map service to remove old SMMP layer and name the shoreline layer better(short)
** TODO See e-mail [2015-06-09 Tue 15:26]

