work.html
<div id="outline-container-sec-48-1-2" class="outline-4">
<h4 id="sec-48-1-2"><span class="section-number-4">48.1.2</span> <span class="todo TODO">TODO</span> Work with Dave Ostanski to a fully populate Lat &amp; Long fields in ParcelAddress layer</h4>
</div>
</div>
<div id="outline-container-sec-48-2" class="outline-3">
<h3 id="sec-48-2"><span class="section-number-3">48.2</span> <span class="todo TODO">TODO</span> Add the Farm Plan and Forest plan parcels to Accela GIS for Randy Sandin, per conversation.</h3>
<div class="outline-text-3" id="text-48-2">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2014-06-11 Wed]</span></span>
No Notes.
See Todd Klinka e-mail <span class="timestamp-wrapper"><span class="timestamp">[2014-06-11 Wed]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-48-3" class="outline-3">
<h3 id="sec-48-3"><span class="section-number-3">48.3</span> <span class="todo TODO">TODO</span> Ortho Imagery broken/Missing from Accela GIS</h3>
<div class="outline-text-3" id="text-48-3">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-09-14 Mon]</span></span>
MJ took them all down to try to improve server performance.
</p>
</div>
<div id="outline-container-sec-48-3-1" class="outline-4">
<h4 id="sec-48-3-1"><span class="section-number-4">48.3.1</span> <span class="todo TODO">TODO</span> Establish 2015 image service on new internal production server or dedicated image service. Possible to coordinate w/ Assessments.</h4>
</div>
</div>
<div id="outline-container-sec-48-4" class="outline-3">
<h3 id="sec-48-4"><span class="section-number-3">48.4</span> <span class="todo TODO">TODO</span> Multiple Address Issues and condos - Kim Simpson/Stacey Wenkel</h3>
<div class="outline-text-3" id="text-48-4">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-07-30 Thu]</span></span>
</p>
</div>
<div id="outline-container-sec-48-4-1" class="outline-4">
<h4 id="sec-48-4-1"><span class="section-number-4">48.4.1</span> <span class="todo TODO">TODO</span> Update Preprod GIS<sub>Layers</sub> to remove no house number address points</h4>
</div>
<div id="outline-container-sec-48-4-2" class="outline-4">
<h4 id="sec-48-4-2"><span class="section-number-4">48.4.2</span> <span class="todo TODO">TODO</span> Check PIN = '0922069179' in preprod for 0 housenumbered address<sub>points</sub>.</h4>
</div>
</div>
<div id="outline-container-sec-48-5" class="outline-3">
<h3 id="sec-48-5"><span class="section-number-3">48.5</span> <span class="todo TODO">TODO</span> Switch Base3 to point at plibrary.hydro.CHNLMIGR<sub>area</sub> for Channel Migration Hazard Layer</h3>
</div>
<div id="outline-container-sec-48-6" class="outline-3">
<h3 id="sec-48-6"><span class="section-number-3">48.6</span> <span class="todo TODO">TODO</span> Enhance Parcel Address to include condo units</h3>
<div class="outline-text-3" id="text-48-6">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-08-12 Wed]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-48-7" class="outline-3">
<h3 id="sec-48-7"><span class="section-number-3">48.7</span> <span class="todo TODO">TODO</span> Forest Stewardship Plan Layer: See e-mail <span class="timestamp-wrapper"><span class="timestamp">[2014-07-23 Wed]</span></span></h3>
</div>
<div id="outline-container-sec-48-8" class="outline-3">
<h3 id="sec-48-8"><span class="section-number-3">48.8</span> <span class="todo TODO">TODO</span> Inspector App issue - John Miller #e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-04-24 Fri]</span></span></h3>
</div>
<div id="outline-container-sec-48-9" class="outline-3">
<h3 id="sec-48-9"><span class="section-number-3">48.9</span> <span class="todo TODO">TODO</span> Address Problem -  Alex Perlman #email <span class="timestamp-wrapper"><span class="timestamp">[2015-04-23 Thu]</span></span></h3>
</div>
<div id="outline-container-sec-48-10" class="outline-3">
<h3 id="sec-48-10"><span class="section-number-3">48.10</span> <span class="todo TODO">TODO</span> System to Document parcel info such as research findings by staff Jim Chan</h3>
<div class="outline-text-3" id="text-48-10">
<p>
IN:<span class="timestamp-wrapper"><span class="timestamp">[2015-03-10 Tue]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-48-11" class="outline-3">
<h3 id="sec-48-11"><span class="section-number-3">48.11</span> <span class="todo TODO">TODO</span> Look at geodata services issue here: <a href="http://resources.arcgis.com/en/help/main/10.1/index.html#//0154000004s0000000">http://resources.arcgis.com/en/help/main/10.1/index.html#//0154000004s0000000</a></h3>
</div>
<div id="outline-container-sec-48-12" class="outline-3">
<h3 id="sec-48-12"><span class="section-number-3">48.12</span> <span class="todo TODO">TODO</span> John Miller - look into addressing issues #e-mail <span class="timestamp-wrapper"><span class="timestamp">[2014-11-13 Thu]</span></span></h3>
</div>
<div id="outline-container-sec-48-13" class="outline-3">
<h3 id="sec-48-13"><span class="section-number-3">48.13</span> <span class="todo TODO">TODO</span> Check out Accela GIS extension</h3>
</div>
</div>

<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49"><span class="section-number-2">49</span> <span class="todo TODO">TODO</span> SUPPER Database Review</h2>
<div class="outline-text-2" id="text-49">
</div><div id="outline-container-sec-49-1" class="outline-3">
<h3 id="sec-49-1"><span class="section-number-3">49.1</span> <span class="todo TODO">TODO</span> Review the feature classes that were moved into Supper that didn't have matching names with layers in plibrary but actually are duplicates of plibrary.</h3>
<div class="outline-text-3" id="text-49-1">
</div><div id="outline-container-sec-49-1-1" class="outline-4">
<h4 id="sec-49-1-1"><span class="section-number-4">49.1.1</span> <span class="todo TODO">TODO</span> Compare schema of the identified matches and add to the list used for the following step.</h4>
</div>
</div>
<div id="outline-container-sec-49-2" class="outline-3">
<h3 id="sec-49-2"><span class="section-number-3">49.2</span> <span class="todo TODO">TODO</span> Investigate the feature classes that matched name with feature classes in plibrary but did not have matching schemas.</h3>
<div class="outline-text-3" id="text-49-2">
</div><div id="outline-container-sec-49-2-1" class="outline-4">
<h4 id="sec-49-2-1"><span class="section-number-4">49.2.1</span> <span class="todo TODO">TODO</span> Of particular interest any of these that match layers used in map services accessed by Accela GIS.</h4>
</div>
</div>
</div>

<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50"><span class="section-number-2">50</span> <span class="todo TODO">TODO</span> Comp Plan Data</h2>
<div class="outline-text-2" id="text-50">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-11-03 Tue]</span></span>
Publish layers edited to support 2016 comp plan maps
</p>
</div>
<div id="outline-container-sec-50-1" class="outline-3">
<h3 id="sec-50-1"><span class="section-number-3">50.1</span> <span class="todo TODO">TODO</span> FPD</h3>
</div>
<div id="outline-container-sec-50-2" class="outline-3">
<h3 id="sec-50-2"><span class="section-number-3">50.2</span> <span class="todo TODO">TODO</span> APD</h3>
</div>
<div id="outline-container-sec-50-3" class="outline-3">
<h3 id="sec-50-3"><span class="section-number-3">50.3</span> <span class="todo TODO">TODO</span> UGA</h3>
</div>
<div id="outline-container-sec-50-4" class="outline-3">
<h3 id="sec-50-4"><span class="section-number-3">50.4</span> <span class="todo TODO">TODO</span> Development Conditions/Sitecore pages:</h3>
<div class="outline-text-3" id="text-50-4">
</div><div id="outline-container-sec-50-4-1" class="outline-4">
<h4 id="sec-50-4-1"><span class="section-number-4">50.4.1</span> <span class="todo TODO">TODO</span> Review all 2008 comp plan amendments for P-suffixes</h4>
</div>
<div id="outline-container-sec-50-4-2" class="outline-4">
<h4 id="sec-50-4-2"><span class="section-number-4">50.4.2</span> <span class="todo TODO">TODO</span> Description for SO-180</h4>
</div>
<div id="outline-container-sec-50-4-3" class="outline-4">
<h4 id="sec-50-4-3"><span class="section-number-4">50.4.3</span> <span class="todo TODO">TODO</span> Title for SO-260. Typo of Business.</h4>
</div>
</div>
</div>

<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51"><span class="section-number-2">51</span> <span class="todo TODO">TODO</span> Update PAA Data &amp; maps.</h2>
<div class="outline-text-2" id="text-51">
</div>
<div id="outline-container-sec-51-1" class="outline-3">
<h3 id="sec-51-1"><span class="section-number-3">51.1</span> <span class="todo TODO">TODO</span> Make City PAA orange in iMap</h3>
<div class="outline-text-3" id="text-51-1">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-06-11 Thu]</span></span>
</p>
</div>
</div>
<div id="outline-container-sec-51-2" class="outline-3">
<h3 id="sec-51-2"><span class="section-number-3">51.2</span> <span class="todo TODO">TODO</span> Make changes that Karen indicated via e-mail on <span class="timestamp-wrapper"><span class="timestamp">[2015-02-13 Fri]</span></span></h3>
</div>
<div id="outline-container-sec-51-3" class="outline-3">
<h3 id="sec-51-3"><span class="section-number-3">51.3</span> <span class="todo TODO">TODO</span> Urban Unincorporated Priority Initiative</h3>
<div class="outline-text-3" id="text-51-3">
</div><div id="outline-container-sec-51-3-1" class="outline-4">
<h4 id="sec-51-3-1"><span class="section-number-4">51.3.1</span> <span class="todo TODO">TODO</span> Create a finite list of all areas under investigation</h4>
<div class="outline-text-4" id="text-51-3-1">
</div><ol class="org-ol"><li><a id="sec-51-3-1-1" name="sec-51-3-1-1"></a><span class="todo TODO">TODO</span> Review City<sub>Annex</sub><sub>Area</sub>. There is one in Northbend.<br  /></li></ol>
</div>
<div id="outline-container-sec-51-3-2" class="outline-4">
<h4 id="sec-51-3-2"><span class="section-number-4">51.3.2</span> <span class="todo TODO">TODO</span> Update layer and map for County Executive</h4>
<div class="outline-text-4" id="text-51-3-2">
<p>
Look in Paper notes <span class="timestamp-wrapper"><span class="timestamp">[2015-06-11 Thu]</span></span>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-51-4" class="outline-3">
<h3 id="sec-51-4"><span class="section-number-3">51.4</span> <span class="todo TODO">TODO</span> Make changes to standard PAA map as Karen F indicated via e-mail on <span class="timestamp-wrapper"><span class="timestamp">[2015-03-18 Wed]</span></span></h3>
</div>
<div id="outline-container-sec-51-5" class="outline-3">
<h3 id="sec-51-5"><span class="section-number-3">51.5</span> <span class="todo TODO">TODO</span> Get buy-off from Karen Freeman</h3>
</div>
<div id="outline-container-sec-51-6" class="outline-3">
<h3 id="sec-51-6"><span class="section-number-3">51.6</span> <span class="todo TODO">TODO</span> Send to Ray Sugui</h3>
</div>
<div id="outline-container-sec-51-7" class="outline-3">
<h3 id="sec-51-7"><span class="section-number-3">51.7</span> <span class="todo TODO">TODO</span> Create small area map</h3>
</div>
</div>

<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52"><span class="section-number-2">52</span> <span class="todo TODO">TODO</span> SMP Designations</h2>
<div class="outline-text-2" id="text-52">
</div><div id="outline-container-sec-52-1" class="outline-3">
<h3 id="sec-52-1"><span class="section-number-3">52.1</span> <span class="todo TODO">TODO</span> Fix the layer file to resolve the problem that Lisa was having with the comp plan map</h3>
</div>
<div id="outline-container-sec-52-2" class="outline-3">
<h3 id="sec-52-2"><span class="section-number-3">52.2</span> <span class="todo TODO">TODO</span> Fix the layer file to resolve the UGA Line conflict problem, IF IT EXISTS</h3>
</div>
<div id="outline-container-sec-52-3" class="outline-3">
<h3 id="sec-52-3"><span class="section-number-3">52.3</span> <span class="todo TODO">TODO</span> Fix the Base3 Map service to remove old SMMP layer and name the shoreline layer better(short)</h3>
</div>
<div id="outline-container-sec-52-4" class="outline-3">
<h3 id="sec-52-4"><span class="section-number-3">52.4</span> <span class="todo TODO">TODO</span> See e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-06-09 Tue 15:26]</span></span></h3>
</div>
</div>
