work.org
* TODO Change map services for DPER to reference GISSQLPUB - MJ
  IN: [2015-09-16 Wed]

* TODO Update All DPER map services with new FLDPLN_100YR_AREA layer replacing FLDPLAIN_AREA
  IN: [2015-08-06 Thu]

* TODO Fix p-suffix  for ORD # 16595 effective in 2009. Have a copy of the Hearing examiners report

* TODO Resolve APD question raised by Rey Sugui e-mail [2015-07-15 Wed]

* TODO Council Dist/CSA Map for Lisa Verner - Assigned to Connie
  IN: [2015-05-21 Thu]

* TODO iMap Issues
** TODO Add Aquatic Area & CAO_Designations to plibrary, notify MJ
** TODO Update and revise openspace description for Growth Pattern

* TODO Future GISMO Parcel Info Report enchancements
*** TODO Implement Assessor's Open Space - Adam
    This was halted pending better information on what data source to use.

* TODO Complete the close out of UAC_AREA and create and document COMMUNITY_COUNCIL_AREA
  Mary would like to be the data steward on this.
  Regional Planning owned layer?

* TODO Make sure all of the rezones have been implemented #email [2014-10-03 Fri]from Jim Chan
** TODO Talk with Kim Claussen - receive list of rezones 2000-Present
** TODO Get list of rezones older than 2000 - pass to Kim for status and zone change.
** TODO Check the zoning layer to see if zoning change was made
** TODO Research rezones where zoning change was approved but not made

* TODO Improve 500' buffer mailing list generation by adding STR based addresses to GISMO mailing list
** TODO Receive list of STR/Permit Type combinations
** TODO Process list to eliminate duplication and simplify logic
** TODO Implement in Mailing list report - Adam

* TODO Setup Zoning History so that users can do research
** TODO Organize the zoning history layers in SUPPER database

* TODO Fix the attributes in STREET_DIRECTION_ZONE

* TODO Look at Addressing Data from Clifford
  Look into Esplanade Street for Clifford Snow. #email [2014-04-11 Fri]
  Bring a Building # example to the Next Data Wrangler Meeting
