work.html

<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53"><span class="section-number-2">53</span> <span class="todo TODO">TODO</span> Change map services for DPER to reference GISSQLPUB - MJ</h2>
<div class="outline-text-2" id="text-53">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-09-16 Wed]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54"><span class="section-number-2">54</span> <span class="todo TODO">TODO</span> Update All DPER map services with new FLDPLN<sub>100YR</sub><sub>AREA</sub> layer replacing FLDPLAIN<sub>AREA</sub></h2>
<div class="outline-text-2" id="text-54">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-08-06 Thu]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55"><span class="section-number-2">55</span> <span class="todo TODO">TODO</span> Fix p-suffix  for ORD # 16595 effective in 2009. Have a copy of the Hearing examiners report</h2>
</div>

<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56"><span class="section-number-2">56</span> <span class="todo TODO">TODO</span> Resolve APD question raised by Rey Sugui e-mail <span class="timestamp-wrapper"><span class="timestamp">[2015-07-15 Wed]</span></span></h2>
</div>

<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57"><span class="section-number-2">57</span> <span class="todo TODO">TODO</span> Council Dist/CSA Map for Lisa Verner - Assigned to Connie</h2>
<div class="outline-text-2" id="text-57">
<p>
IN: <span class="timestamp-wrapper"><span class="timestamp">[2015-05-21 Thu]</span></span>
</p>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58"><span class="section-number-2">58</span> <span class="todo TODO">TODO</span> iMap Issues</h2>
<div class="outline-text-2" id="text-58">
</div><div id="outline-container-sec-58-1" class="outline-3">
<h3 id="sec-58-1"><span class="section-number-3">58.1</span> <span class="todo TODO">TODO</span> Add Aquatic Area &amp; CAO<sub>Designations</sub> to plibrary, notify MJ</h3>
</div>
<div id="outline-container-sec-58-2" class="outline-3">
<h3 id="sec-58-2"><span class="section-number-3">58.2</span> <span class="todo TODO">TODO</span> Update and revise openspace description for Growth Pattern</h3>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59"><span class="section-number-2">59</span> <span class="todo TODO">TODO</span> Future GISMO Parcel Info Report enchancements</h2>
<div class="outline-text-2" id="text-59">
</div><div id="outline-container-sec-59-0-1" class="outline-4">
<h4 id="sec-59-0-1"><span class="section-number-4">59.0.1</span> <span class="todo TODO">TODO</span> Implement Assessor's Open Space - Adam</h4>
<div class="outline-text-4" id="text-59-0-1">
<p>
This was halted pending better information on what data source to use.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60"><span class="section-number-2">60</span> <span class="todo TODO">TODO</span> Complete the close out of UAC<sub>AREA</sub> and create and document COMMUNITY<sub>COUNCIL</sub><sub>AREA</sub></h2>
<div class="outline-text-2" id="text-60">
<p>
Mary would like to be the data steward on this.
Regional Planning owned layer?
</p>
</div>
</div>

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61"><span class="section-number-2">61</span> <span class="todo TODO">TODO</span> Make sure all of the rezones have been implemented #email <span class="timestamp-wrapper"><span class="timestamp">[2014-10-03 Fri]</span></span>from Jim Chan</h2>
<div class="outline-text-2" id="text-61">
</div><div id="outline-container-sec-61-1" class="outline-3">
<h3 id="sec-61-1"><span class="section-number-3">61.1</span> <span class="todo TODO">TODO</span> Talk with Kim Claussen - receive list of rezones 2000-Present</h3>
</div>
<div id="outline-container-sec-61-2" class="outline-3">
<h3 id="sec-61-2"><span class="section-number-3">61.2</span> <span class="todo TODO">TODO</span> Get list of rezones older than 2000 - pass to Kim for status and zone change.</h3>
</div>
<div id="outline-container-sec-61-3" class="outline-3">
<h3 id="sec-61-3"><span class="section-number-3">61.3</span> <span class="todo TODO">TODO</span> Check the zoning layer to see if zoning change was made</h3>
</div>
<div id="outline-container-sec-61-4" class="outline-3">
<h3 id="sec-61-4"><span class="section-number-3">61.4</span> <span class="todo TODO">TODO</span> Research rezones where zoning change was approved but not made</h3>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62"><span class="section-number-2">62</span> <span class="todo TODO">TODO</span> Improve 500' buffer mailing list generation by adding STR based addresses to GISMO mailing list</h2>
<div class="outline-text-2" id="text-62">
</div><div id="outline-container-sec-62-1" class="outline-3">
<h3 id="sec-62-1"><span class="section-number-3">62.1</span> <span class="todo TODO">TODO</span> Receive list of STR/Permit Type combinations</h3>
</div>
<div id="outline-container-sec-62-2" class="outline-3">
<h3 id="sec-62-2"><span class="section-number-3">62.2</span> <span class="todo TODO">TODO</span> Process list to eliminate duplication and simplify logic</h3>
</div>
<div id="outline-container-sec-62-3" class="outline-3">
<h3 id="sec-62-3"><span class="section-number-3">62.3</span> <span class="todo TODO">TODO</span> Implement in Mailing list report - Adam</h3>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63"><span class="section-number-2">63</span> <span class="todo TODO">TODO</span> Setup Zoning History so that users can do research</h2>
<div class="outline-text-2" id="text-63">
</div><div id="outline-container-sec-63-1" class="outline-3">
<h3 id="sec-63-1"><span class="section-number-3">63.1</span> <span class="todo TODO">TODO</span> Organize the zoning history layers in SUPPER database</h3>
</div>
</div>

<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64"><span class="section-number-2">64</span> <span class="todo TODO">TODO</span> Fix the attributes in STREET<sub>DIRECTION</sub><sub>ZONE</sub></h2>
</div>

<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65"><span class="section-number-2">65</span> <span class="todo TODO">TODO</span> Look at Addressing Data from Clifford</h2>
<div class="outline-text-2" id="text-65">
<p>
Look into Esplanade Street for Clifford Snow. #email <span class="timestamp-wrapper"><span class="timestamp">[2014-04-11 Fri]</span></span>
Bring a Building # example to the Next Data Wrangler Meeting
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pablo</p>
<p class="date">Created: 2017-03-30 Thu 13:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>